import globe from './../assets/images/resources/globe.svg'
import telegram from './../assets/images/resources/telegram.svg'
import vk from './../assets/images/resources/vk.svg'

export const constants = {

    questions: [
        { question: 'Как войти в личный кабинет?', answer: 'Логин – Фамилия абитуриента, пароль – номер паспорта (6 цифр)', link: '' },
        { question: 'Какие спортивные секции есть в Университете?', answer: 'баскетбол (муж), волейбол (муж / жен), настольный теннис, спортивная борьба (самбо, дзюдо, грепплинг), легкая атлетика, шахматы, капоэйра, киберспорт, танко-модельный спорт, спортивный бридж', link: '' },
        { question: 'Время работы приемной комиссии?', answer: 'Понедельник – Пятница: 10:00 – 18:00, Суббота-Воскресенье: 10:00 - 18:00', link: '' },
        { question: 'Где находятся общежития университета?', answer: 'Общежития расположены по адресу: 1) Вадковский пер., д.18; 2) Студенческая ул., д. 33;', link: '' },
        { question: 'Что такое Фрезер и как до него добраться?', answer: '3-й корпус Станкина, Добираться от Авиамоторной на любых *59* автобусах: 59, 59к, 759.', link: '' },
        { question: 'Есть ли столовая в вузе и где она находится?', answer: 'Общая столовая находится на втором этаже старого корпуса МГТУ Станкин; Буфет находится на третьем этаже нового корпуса. ', link: '' },
        { question: 'До скольки работает столовая?', answer: 'В настоящее время столовая работает с 9:00 до 18:00', link: '' },
        { question: 'Где можно получить логины и пароли для входа в электронную образовательную среду?', answer: 'Логины и пароли для входа в электронную образовательную среду (edu.stankin.ru)  можно получить лично в отделе по работе с аспирантами (ауд.233). Аспиранты, заканчивающие магистратуру или специалитет в МГТУ "Станкин" для входа используют уже имеющиеся логины и пароли. Для смены пароля обращаться в ауд.ТП 3-9.', link: '' },
        { question: 'Зачем нужен ЭОС?', answer: 'Во время дистанционных пар, часы, установленные расписанием занятий, необходимо находиться в ЭОС для проведения совместной работы с преподавателями и ознакомления с размещенными там материалами, которые будут дополняться. Средствами ЭОС будет налажен контроль посещаемости. Также в ЭОС есть задания, тесты, лабораторные работы, которые вы сможете загрузить для проверки преподавателем. Некоторые тесты и задания решаются онлайн с ограничением по времени. Такие задания проверяются автоматически системой и показывают ваш бал.', link: '' },
        { question: 'Что за клуб находится в Станкине?', answer: 'Здесь вы сможете показать себя и многому научиться, со студентами здесь работают профессиональные преподаватели по вокалу и актёрскому мастерству, режиссёры, хореографы, концертмейстеры и звукорежиссёры. Все они обладают огромным опытом в работе со студентами и готовы всячески поддержать ваши таланты  в области творчества. Основные коллективы клуба на сегодня – шоу-студия «Тип-Топ», вокальная студия «Квалитет», танцевальный коллектив «Каскад», технический коллектив и музыкальная группа.', link: '' },
        { question: 'Где найти расписание занятий?', answer: 'Расписание занятий можно найти в ЭОС', link: 'https://edu.stankin.ru/course/view.php?id=11557' },
        { question: 'Что такое модули?', answer: 'Наш университет имеет модульную систему обучения. Для получения допуска к зачету или экзамену в течение семестра по каждому предмету необходимо получить баллы по двум модулям. В вузе работает балльно-рейтинговая система. При сдаче модуля в отведенные для этого промежутки времени, вы получаете от 25 до 54 баллов. По согласованию с преподавателями, вы можете сдать модульные работы позже выделенных сроков. Но обратите внимание, в зависимости от того, насколько поздно вы закрыли модуль, отметка за работу будет снижена или приравнена к 25 баллам.', link: '' },
        { question: 'Как рассчитать  предварительный средний рейтинг?', answer: 'Ознакомиться с коэффициентами по предметам и рассчитать предварительный средний рейтинг можно в модульном журнале', link: 'https://lk.stankin.ru' },
        { question: 'Как оформить социальную карту?', answer: 'Проверьте на сайте http://www.soccard.ru/students есть ли ваши данные в реестре студентов. Если ваших данных нет в Реестре, обратитесь в профком студентов МГТУ «Станкин» с просьбой передать информацию в Реестр студентов. После того, как ваши данные появятся в реестре студентов, гражданам РФ необходимо заказать услугу по выпуску социальной карты на портале государственных услуг , а иностранным гражданам необходимо обратиться в Многофункциональный центр (МФЦ) города Москвы. Ближайший к вам можно найти на сайте http://www.soccard.ru/articles/delivery', link: '' },
    ],

    questionsProf: [
        { question: 'Где находится профком Станкина?', answer: 'Профком находится в старом корпусе, кабинет 204', link: '' },
        { question: 'Номер телефона профкома?', answer: 'Контактные данные: Телефон: +7(499)972-94-16', link: '' },
        { question: 'Режим работы профкома?', answer: 'Режим работы профкома (кабинет 204): Пн-Пт с 10:00 до 18:00', link: '' },
        { question: 'Какие документы нужны для получения материальной поддержки?', answer: '', link: '' },
        { question: 'Как получить льготный проезд?', answer: '', link: '' },
    ],

    questionsDec: [
        { question: 'Номер телефона единого деканата?', answer: 'Контактный телефон: (499) 973-39-07, местный: 4-25', link: '' },
        { question: 'Режим работы единого деканата?', answer: 'Прием студентов бакалавриата, специалитета и магистратуры в аудитории 233 производится с понедельника по пятницу с 8.00 до 20.00 и в субботу с 10.00 до 15.00 (без перерыва на обед). Прием студентов аспирантуры в аудитории 233 производится с понедельника по пятницу с 9.00 до 18.00. Прием студентов в аудитории 218 производится с понедельника по пятницу с 9.00 до 18.00 (без перерыва на обед).', link: '' },
        { question: 'Как перевестись из другого вуза?', answer: '', link: '' },
        { question: 'Что такое академический отпуск?', answer: '', link: '' },
        { question: 'Как сменить направление внутри вуза?', answer: '', link: '' },
    ],

    links: [
        { link: 'Главная', path: '/' },
        { link: 'Институты', path: '/institutes' },
        { link: 'Преподаватели', path: '/teachers' },
        { link: 'Личный кабинет', path: '/account' },
        { link: 'Вопросы', path: '/questions' },
    ],

    linksResources: [
        { name: 'Модульный журнал', path: 'https://lk.stankin.ru/', img: globe },
        { name: 'Карта корпусов', path: 'https://vstankine.ru/content/navigaciya-po-universitetu', img: globe },
        { name: 'ЭОС', path: 'https://edu.stankin.ru/', img: globe },
        { name: 'МГТУ «СТАНКИН»', path: 'https://stankin.ru/ru/', img: globe },
        { name: '@stankin_bot', path: 'https://t.me/stankin_bot', img: telegram },
        { name: 'МГТУ «СТАНКИН»', path: 'https://vk.com/msut_stankin', img: vk },
    ],

    allQuestions: [
        { question: 'Как войти в личный кабинет?' },
        { question: 'Какие спортивные секции есть в Университете?' },
        { question: 'Время работы приемной комиссии?' },
        { question: 'Где находятся общежития университета?' },
        { question: 'Что такое Фрезер и как до него добраться?' },
        { question: 'Есть ли столовая в вузе и где она находится?' },
        { question: 'До скольки работает столовая?' },
        { question: 'Где можно получить логины и пароли для входа в электронную образовательную среду?' },
        { question: 'Зачем нужен ЭОС?' },
        { question: 'Что за клуб находится в Станкине?' },
        { question: 'Где найти расписание занятий?' },
        { question: 'Что такое модули?' },
        { question: 'Как рассчитать  предварительный средний рейтинг?' },
        { question: 'Как оформить социальную карту?' },
        { question: 'Где находится профком Станкина?' },
        { question: 'Номер телефона профкома?' },
        { question: 'Режим работы профкома?' },
        { question: 'Какие документы нужны для получения материальной поддержки?' },
        { question: 'Как получить льготный проезд?' },
        { question: 'Номер телефона единого деканата?' },
        { question: 'Режим работы единого деканата?' },
        { question: 'Как перевестись из другого вуза?' },
        { question: 'что такое академический отпуск?' },
        { question: 'Как сменить направление внутри вуза?' },
    ],

    subjects: [
        { subject: 'Автоматизация обеспечения экологического качества в машиностроении', coef: '3', mark: '37', exam: 'Экзамен' },
        { subject: 'Защита окружающей среды и производственного персонала в чрезвычайных ситуациях', coef: '3', mark: '45', exam: 'Экзамен' },
        { subject: 'Инженерно-экологическое обеспечение безопасности машиностроительного производства', coef: '3', mark: '30', exam: 'Зачет' },
        { subject: 'Надежность технических систем и техногенный риск', coef: '3', mark: '44', exam: 'Зачет' },
        { subject: 'Основы токсикологии', coef: '2.5', mark: '45', exam: 'Зачет' },
        { subject: 'Прикладная физическая культура', coef: '1', mark: '37', exam: 'Зачет' },
        { subject: 'Теоретические основы защиты окружающей среды', coef: '3', mark: '26', exam: 'Экзамен' },
        { subject: 'Теория горения и взрыва', coef: '3', mark: '54', exam: 'Экзамен' },
    ],

    account_links: [
        { name: 'Основная информация' },
        { name: 'Рейтинг' },
        { name: 'Список группы' },
    ],

    references: [
        { question: 'Где можно получить справку о том, что я являюсь студентом университета?', department: 'в отделе \"Управление персоналом\"', cabinet: 'Кабинет 0609 (новый корпус)', phone: '+7 (499) 972-95-13' },
        { question: 'Где можно получить справку о периоде обучения или обучении с оценками об успеваемости?', department: 'в едином деканате', cabinet: 'Аудитория 233 (старый корпус)', phone: '+7 (499) 973-38-34' },
        { question: 'Где можно получить справку для военкомата?', department: 'во втором отделе', cabinet: 'Кабинет 0605 (новый корпус)', phone: '+7 (499) 972-94-24' },
        { question: 'Где можно получить справку о размере и наличии стипендии?', department: 'в бухгалтерии', cabinet: 'Аудитория 0732 (новый корпус)', phone: '+7 (499) 972-94-55' }
    ]

}
